# Розробіть скрипт, який приймає шлях до директорії в якості аргументу командного рядка 
# і візуалізує структуру цієї директорії, виводячи імена всіх піддиректорій та файлів. 
# Для кращого візуального сприйняття, імена директорій та файлів мають відрізнятися за 
# кольором.

# Вимоги до завдання:
# 1. Створіть віртуальне оточення Python для ізоляції залежностей проекту.
# 2. Скрипт має отримувати шлях до директорії як аргумент при запуску. 
# Цей шлях вказує, де знаходиться директорія, структуру якої потрібно відобразити.
# 3. Використання бібліотеки colorama для реалізації кольорового виведення.
# 4. Скрипт має коректно відображати як імена директорій, так і імена файлів, 
# використовуючи рекурсивний спосіб обходу директорій 
# (можна, за бажанням, використати не рекурсивний спосіб).
# 5. Повинна бути перевірка та обробка помилок, наприклад, 
# якщо вказаний шлях не існує або він не веде до директорії.

import sys
from pathlib import Path
from colorama import Fore

def visualize_directory_structure(directory_path, level=0):

    # Перевірка, чи існує вказаний шлях та чи є це директорія
    path = Path(directory_path)
    if not path.exists() or not path.is_dir():
        print(f"{Fore.RED}Шлях '{directory_path}' не існує або не є директорією.")
        return

    for item in path.iterdir():
        if item.is_dir():
            print(f"{Fore.BLUE}{'    ' * level} {item.name}")  # Вивід для директорій з синім кольором
            visualize_directory_structure(item, level + 1)  # Рекурсивний виклик для вкладених директорій
        else:
            print(f"{Fore.GREEN}{'    ' * level} {item.name}")  # Вивід для файлів з зеленим кольором

if __name__ == "__main__":
    if len(sys.argv) != 2:
        print(f"{Fore.RED}Потрібно передати лише один аргумент - шлях до директорії")
    else:
        directory_path = sys.argv[1]
        visualize_directory_structure(directory_path)
       